wosayttn/M55M1BSP/Library/StdDriver/src/scu/mpc.c
    /* Partially configure the limit word */
    p_mpc->blk_idx = limit_word_idx;
    word_value     = p_mpc->blk_lutn;
    if (attr == MPC_SIE_SEC_ATTR_NONSECURE)
    {
        word_value |= limit_word_mask;
    }
    else
    {
        word_value &= ~limit_word_mask;
    }
    p_mpc->blk_idx  = limit_word_idx;
    p_mpc->blk_lutn = word_value;

    /* Commit the configuration change */
    __DSB();
    __ISB();

    return MPC_SIE_ERR_NONE;
}

enum mpc_sie_error_t
mpc_sie_get_region_config(struct mpc_sie_dev_t *dev, uint32_t base, uint32_t limit, enum mpc_sie_sec_attr_t *attr)
{
    enum mpc_sie_sec_attr_t attr_prev;
    uint32_t block_size;
    uint32_t block_size_mask;
    enum mpc_sie_intern_error_t error;
    uint32_t first_word_idx;
    uint32_t first_word_mask;
    uint32_t i;
    uint32_t limit_word_idx;
    uint32_t limit_word_mask;
    uint32_t nr_words;
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;
    const struct mpc_sie_memory_range_t *range;
    uint32_t word_value;

    if (dev->data->is_initialized != true)
    {
        return MPC_SIE_NOT_INIT;
    }

    if (attr == 0)
    {
        return MPC_SIE_INVALID_ARG;
    }

    /*
     * Initialize the security attribute to mixed in case of early
     * termination of this function. A caller that does not check the
     * returned error will act as if it does not know anything about the
     * region queried, which is the safest bet
     */
    *attr = MPC_SIE_SEC_ATTR_MIXED;

    /*
     * If the base and limit are not aligned, align them and make sure
     * that the resulting region fully includes the original region
     */
    block_size = (1 << (p_mpc->blk_cfg + MPC_SIE_BLK_CFG_OFFSET));

    block_size_mask = block_size - 1;
    base &= ~(block_size_mask);
    limit &= ~(block_size_mask);
    limit += block_size - 1; /* Round to the upper block address,
                              * and then remove one to get the preceding
                              * address.
                              */

    /* Get the bitmasks used to select the bits in the LUT */
    error = get_lut_masks(dev, base, limit, &range, &first_word_idx, &nr_words, &first_word_mask, &limit_word_mask);

    limit_word_idx = first_word_idx + nr_words - 1;

    if (error != MPC_SIE_INTERN_ERR_NONE)
    {
        /* Map internal error code lower than 0 to generic error */
        if (error < 0)
        {
            return MPC_SIE_ERR_INVALID_RANGE;
        }
        return (enum mpc_sie_error_t)error;
    }

    /* Set the block index to the first word that will be updated */
    p_mpc->blk_idx = first_word_idx;

    /* If only one word needs to be touched in the LUT */
    if (nr_words == 1)
    {
        word_value = p_mpc->blk_lutn;
        word_value &= first_word_mask;
        if (word_value == 0)
        {
            *attr = MPC_SIE_SEC_ATTR_SECURE;
            /*
             * If there are differences between the mask and the word value,
             * it means that the security attributes of blocks are mixed
             */
        }
        else if (word_value ^ first_word_mask)
        {
            *attr = MPC_SIE_SEC_ATTR_MIXED;
        }
        else
        {
            *attr = MPC_SIE_SEC_ATTR_NONSECURE;
        }
        return MPC_SIE_ERR_NONE;
    }

    /* Get the partial configuration of the first word */
    word_value = p_mpc->blk_lutn & first_word_mask;
    if (word_value == 0x00000000)
    {
        *attr = MPC_SIE_SEC_ATTR_SECURE;
    }
    else if (word_value ^ first_word_mask)
    {
        *attr = MPC_SIE_SEC_ATTR_MIXED;
        /*
         * Bail out as the security attribute will be the same regardless
         * of the configuration of other blocks
         */
        return MPC_SIE_ERR_NONE;
    }
    else
    {
        *attr = MPC_SIE_SEC_ATTR_NONSECURE;
    }
    /*
     * Store the current found attribute, to check that all the blocks indeed
     * have the same security attribute.
     */
    attr_prev = *attr;

    /* Get the configuration of the intermediate words if there are any */
    for (i = first_word_idx + 1; i < limit_word_idx; i++)
    {
        p_mpc->blk_idx = i;
        word_value     = p_mpc->blk_lutn;
        if (word_value == 0x00000000)
        {
            *attr = MPC_SIE_SEC_ATTR_SECURE;
        }
        else if (word_value == 0xFFFFFFFF)
        {
            *attr = MPC_SIE_SEC_ATTR_NONSECURE;
        }
        else
        {
            *attr = MPC_SIE_SEC_ATTR_MIXED;
            return MPC_SIE_ERR_NONE;
        }

        /* If the attribute is different than the one found before, bail out */
        if (*attr != attr_prev)
        {
            *attr = MPC_SIE_SEC_ATTR_MIXED;
            return MPC_SIE_ERR_NONE;
        }
        attr_prev = *attr;
    }

    /* Get the partial configuration of the limit word */
    p_mpc->blk_idx = limit_word_idx;
    word_value     = p_mpc->blk_lutn & limit_word_mask;
    if (word_value == 0x00000000)
    {
        *attr = MPC_SIE_SEC_ATTR_SECURE;
    }
    else if (word_value ^ first_word_mask)
    {
        *attr = MPC_SIE_SEC_ATTR_MIXED;
        return MPC_SIE_ERR_NONE;
    }
    else
    {
        *attr = MPC_SIE_SEC_ATTR_NONSECURE;
    }

    if (*attr != attr_prev)
    {
        *attr = MPC_SIE_SEC_ATTR_MIXED;
        return MPC_SIE_ERR_NONE;
    }

    return MPC_SIE_ERR_NONE;
}

enum mpc_sie_error_t mpc_sie_get_ctrl(struct mpc_sie_dev_t *dev, uint32_t *ctrl_val)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    if (dev->data->is_initialized != true)
    {
        return MPC_SIE_NOT_INIT;
    }

    if (ctrl_val == 0)
    {
        return MPC_SIE_INVALID_ARG;
    }

    *ctrl_val = p_mpc->ctrl;

    return MPC_SIE_ERR_NONE;
}

enum mpc_sie_error_t mpc_sie_set_ctrl(struct mpc_sie_dev_t *dev, uint32_t mpc_ctrl)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    if (dev->data->is_initialized != true)
    {
        return MPC_SIE_NOT_INIT;
    }

    p_mpc->ctrl = mpc_ctrl;

