wosayttn/M55M1BSP/Library/StdDriver/src/scu/mpc.c
    return MPC_SIE_ERR_NONE;
}

enum mpc_sie_error_t mpc_sie_get_sec_resp(struct mpc_sie_dev_t *dev, enum mpc_sie_sec_resp_t *sec_rep)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;
    bool gating_present             = false;

    if (dev->data->is_initialized != true)
    {
        return MPC_SIE_NOT_INIT;
    }

    if (sec_rep == NULL)
    {
        return MPC_SIE_INVALID_ARG;
    }

    if (dev->data->sie_version == SIE200)
    {
        if (p_mpc->ctrl & MPC_SIE200_CTRL_SEC_RESP)
        {
            *sec_rep = MPC_SIE_RESP_BUS_ERROR;
        }
        else
        {
            *sec_rep = MPC_SIE_RESP_RAZ_WI;
        }

    }
    else if (dev->data->sie_version == SIE300)
    {
        mpc_sie_is_gating_present(dev, &gating_present);
        if (!gating_present)
        {
            return MPC_SIE_ERR_GATING_NOT_PRESENT;
        }

        if (p_mpc->ctrl & MPC_SIE300_CTRL_SEC_RESP)
        {
            /* MPC returns a BUS ERROR response */
            *sec_rep = MPC_SIE_RESP_BUS_ERROR;
        }
        else
        {
            /* MPC sets the ready signals LOW, which stalls any transactions */
            *sec_rep = MPC_SIE_RESP_WAIT_GATING_DISABLED;
        }
    }
    else
    {
        return MPC_SIE_UNSUPPORTED_HARDWARE_VERSION;
    }

    return MPC_SIE_ERR_NONE;
}

enum mpc_sie_error_t mpc_sie_set_sec_resp(struct mpc_sie_dev_t *dev, enum mpc_sie_sec_resp_t sec_rep)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;
    bool gating_present             = false;

    if (dev->data->is_initialized != true)
    {
        return MPC_SIE_NOT_INIT;
    }

    if (dev->data->sie_version == SIE200)
    {
        if (sec_rep == MPC_SIE_RESP_BUS_ERROR)
        {
            p_mpc->ctrl |= MPC_SIE200_CTRL_SEC_RESP;
        }
        else if (sec_rep == MPC_SIE_RESP_RAZ_WI)
        {
            p_mpc->ctrl &= ~MPC_SIE200_CTRL_SEC_RESP;
        }
        else
        {
            return MPC_SIE_INVALID_ARG;
        }

    }
    else if (dev->data->sie_version == SIE300)
    {
        mpc_sie_is_gating_present(dev, &gating_present);
        if (!gating_present)
        {
            return MPC_SIE_ERR_GATING_NOT_PRESENT;
        }

        if (sec_rep == MPC_SIE_RESP_BUS_ERROR)
        {
            p_mpc->ctrl |= MPC_SIE300_CTRL_SEC_RESP;
        }
        else if (sec_rep == MPC_SIE_RESP_WAIT_GATING_DISABLED)
        {
            p_mpc->ctrl &= ~MPC_SIE300_CTRL_SEC_RESP;
        }
        else
        {
            return MPC_SIE_INVALID_ARG;
        }

    }
    else
    {
        return MPC_SIE_UNSUPPORTED_HARDWARE_VERSION;
    }

    return MPC_SIE_ERR_NONE;
}

enum mpc_sie_error_t mpc_sie_irq_enable(struct mpc_sie_dev_t *dev)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    if (dev->data->is_initialized != true)
    {
        return MPC_SIE_NOT_INIT;
    }

    p_mpc->int_en |= MPC_SIE_INT_BIT;

    return MPC_SIE_ERR_NONE;
}

void mpc_sie_irq_disable(struct mpc_sie_dev_t *dev)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    p_mpc->int_en &= ~MPC_SIE_INT_BIT;
}

void mpc_sie_clear_irq(struct mpc_sie_dev_t *dev)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    p_mpc->int_clear = MPC_SIE_INT_BIT;
}

uint32_t mpc_sie_irq_state(struct mpc_sie_dev_t *dev)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    return (p_mpc->int_stat & MPC_SIE_INT_BIT);
}

enum mpc_sie_error_t mpc_sie_lock_down(struct mpc_sie_dev_t *dev)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    if (dev->data->is_initialized != true)
    {
        return MPC_SIE_NOT_INIT;
    }

    p_mpc->ctrl |= (MPC_SIE_CTRL_AUTOINCREMENT | MPC_SIE_CTRL_SEC_LOCK_DOWN);

    return MPC_SIE_ERR_NONE;
}

enum mpc_sie_error_t mpc_sie_is_gating_present(struct mpc_sie_dev_t *dev, bool *gating_present)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    if (dev->data->is_initialized != true)
    {
        return MPC_SIE_NOT_INIT;
    }

    if (dev->data->sie_version != SIE300)
    {
        return MPC_SIE_UNSUPPORTED_HARDWARE_VERSION;
    }

    *gating_present = (bool)(p_mpc->ctrl & MPC_SIE300_CTRL_GATE_PRESENT);

    return MPC_SIE_ERR_NONE;
}

uint32_t get_sie_version(struct mpc_sie_dev_t *dev)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    return p_mpc->pidr0 & MPC_PIDR0_SIE_VERSION_MASK;
}

bool mpc_sie_get_gate_ack(struct mpc_sie_dev_t *dev)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    return (bool)(p_mpc->ctrl & MPC_SIE300_CTRL_GATE_ACK);
}

void mpc_sie_request_gating(struct mpc_sie_dev_t *dev)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    p_mpc->ctrl |= MPC_SIE300_CTRL_GATE_REQ;
}

void mpc_sie_release_gating(struct mpc_sie_dev_t *dev)
{
    struct mpc_sie_reg_map_t *p_mpc = (struct mpc_sie_reg_map_t *)dev->cfg->base;

    p_mpc->ctrl &= ~MPC_SIE300_CTRL_GATE_REQ;
}

#define N_MEM_RANGES (2)
int32_t MPC_InitCFG(
    const uint32_t u32MPC_Base,
    const uint32_t u32MemBase, const uint32_t u32MemSize,
    const uint32_t u32SecureSize    /* Length (in bytes) of secure region */
)
{
    enum mpc_sie_error_t ret = MPC_SIE_ERR_NONE;
    /* Secure range */
    const struct mpc_sie_memory_range_t mpc_range_s =
    {
        .base = u32MemBase,
        .limit = u32MemBase + u32MemSize - 1,
        .range_offset = 0,
        .attr = MPC_SIE_SEC_ATTR_SECURE
    };

    /* Non-Secure range */
    const struct mpc_sie_memory_range_t mpc_range_ns =
    {
        .base = u32MemBase + NS_OFFSET,
        .limit = u32MemBase + NS_OFFSET + u32MemSize - 1,
        .range_offset = 0,
        .attr = MPC_SIE_SEC_ATTR_NONSECURE
    };
    /* Consolidated ranges */
    const struct mpc_sie_memory_range_t *mpc_range_list[N_MEM_RANGES] = { &mpc_range_s, &mpc_range_ns };

